---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalLinkType.RotationX
source: html/dfbeb0ee-5d71-95b7-6fa9-62e1db267756.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLinkType.RotationX Property

Fixity of rotation around X.

## Syntax (C#)
```csharp
public AnalyticalFixityState RotationX { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The fixity state rotationX is not valid for Analytical Link Type parameters.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration